Autodesk.Revit.DB.Plumbing.PipeSystemType
Since:
2012
An enumerated type listing all the possible pipe system types for a connector object.
Since:
2012

Autodesk.Revit.DB.Plumbing.PipeSystemType.Vent
Pipe System Type is Vent.

Autodesk.Revit.DB.Plumbing.PipeSystemType.Global
Pipe System Type is Global.

Autodesk.Revit.DB.Plumbing.PipeSystemType.Fitting
Pipe System Type is Fitting.

Autodesk.Revit.DB.Plumbing.PipeSystemType.FireProtectOther
Pipe System Type is FireProtectOther.

Autodesk.Revit.DB.Plumbing.PipeSystemType.FireProtectPreaction
Pipe System Type is FireProtectPreaction.

Autodesk.Revit.DB.Plumbing.PipeSystemType.FireProtectDry
Pipe System Type is FireProtectDry.

Autodesk.Revit.DB.Plumbing.PipeSystemType.FireProtectWet
Pipe System Type is FireProtectWet.

Autodesk.Revit.DB.Plumbing.PipeSystemType.OtherPipe
Pipe System Type is OtherPipe.

Autodesk.Revit.DB.Plumbing.PipeSystemType.DomesticColdWater
Pipe System Type is DomesticColdWater.

Autodesk.Revit.DB.Plumbing.PipeSystemType.DomesticHotWater
Pipe System Type is DomesticHotWater.

Autodesk.Revit.DB.Plumbing.PipeSystemType.Sanitary
Pipe System Type is Sanitary.

Autodesk.Revit.DB.Plumbing.PipeSystemType.ReturnHydronic
Pipe System Type is ReturnHydronic.

Autodesk.Revit.DB.Plumbing.PipeSystemType.SupplyHydronic
Pipe System Type is SupplyHydronic.

Autodesk.Revit.DB.Plumbing.PipeSystemType.UndefinedSystemType
Pipe System Type is UndefinedSystemClassification.